app/views/user_mailer/send_alert_email.html.erb

                       <p>
                        <% @newsletter.topics.each do |topic| %>
---
SELECT `topics`.* FROM `topics` INNER JOIN `newsletter_topics` ON `topics`.`id` = `newsletter_topics`.`topic_id` WHERE `newsletter_topics`.`newsletter_id` = 6