app/controllers/newsletters_controller.rb

SELECT `newsletters`.* FROM `newsletters`
---
  def index
    @newsletters = Newsletter.all

SELECT `newsletters`.* FROM `newsletters`
---
  def index2
    @newsletters = Newsletter.all

INSERT INTO `newsletters` (`title`, `description`, `url_to_image`, `created_at`, `updated_at`) VALUES ('Como dejar la mari', 'No se puede ', 'https://zululandobserver.co.za/wp-content/uploads/sites/56/2018/08/aa1608abuse1_98626_tn.jpg', '2018-10-21 08:29:32', '2018-10-21 08:29:32')
INSERT INTO `newsletter_topics` (`newsletter_id`, `topic_id`, `created_at`, `updated_at`) VALUES (1, 3, '2018-10-20 00:24:13', '2018-10-20 00:24:13')
---
  def create
    @newsletter = Newsletter.new(newsletter_params)

    if @newsletter.save
      @topics=params[:topics]
      @topics.each do |this_topic|
        NewsletterTopic.create(:newsletter_id => @newsletter.id, :topic_id => this_topic)

DELETE FROM `newsletters` WHERE `newsletters`.`id` = 1
---
  def destroy
    @newsletter.destroy

SELECT  `newsletters`.* FROM `newsletters` WHERE `newsletters`.`id` = 1 LIMIT 1
---
    def set_newsletter
      @newsletter = Newsletter.find(params[:id])