app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics`
---
  def index
    @topics = Topic.all

SELECT `topics`.* FROM `topics`
---
  def index2
    @topics = Topic.all

SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = NULL LIMIT 1
---
    def set_topic
      @topic = Topic.find(params[:id])