app/controllers/users_controller.rb

INSERT INTO `users` (`firstname`, `lastname`, `email`, `account`, `created_at`, `updated_at`) VALUES ('Marlon', 'Noguera', 'menoguerar@unal', 12345, '2018-11-23 03:50:43', '2018-11-23 03:50:43')
---
  def create
    @user = User.new(user_params)

    if @user.save