app/controllers/user_topics_controller.rb

  def index
    @user_topics = UserTopic.all
---
SELECT `user_topics`.* FROM `user_topics`

  def create
    @user_topic = UserTopic.new(user_topic_params)

    if @user_topic.save
---
INSERT INTO `user_topics` (`user_id`, `topic_id`, `created_at`, `updated_at`) VALUES (11, 6, '2018-10-23 21:51:59', '2018-10-23 21:51:59')